### 文件简介 ： 初始化项目中表格基础数据

### 一、 重置项目表格基础数据（清空表格数据，重置表格自增长）

# 1. 重置 judge_draw_result 表

TRUNCATE TABLE judge_draw_result;

# 2. 重置 seat_group

TRUNCATE TABLE seat_group;

# 3. 重置 config 表

TRUNCATE TABLE config;

### 二、 生成项目表格基础数据

# 1.  初始化 judge_draw_result 表

INSERT INTO judge_draw_result(seat_id, judge_id, pad_id, group_id, type_name)
values (1, 0, 0, 1, "光缆续接"),
       (2, 0, 0, 1, "光缆续接"),
       (3, 0, 0, 1, "视频搭建"),
       (4, 0, 0, 1, "视频搭建"),
       (5, 0, 0, 1, "交换机组网"),
       (6, 0, 0, 1, "交换机组网"),

       (7, 0, 0, 2, "光缆续接"),
       (8, 0, 0, 2, "光缆续接"),
       (9, 0, 0, 2, "视频搭建"),
       (10, 0, 0, 2, "视频搭建"),
       (11, 0, 0, 2, "交换机组网"),
       (12, 0, 0, 2, "交换机组网"),

       (13, 0, 0, 3, "光缆续接"),
       (14, 0, 0, 3, "光缆续接"),
       (15, 0, 0, 3, "视频搭建"),
       (16, 0, 0, 3, "视频搭建"),
       (17, 0, 0, 3, "交换机组网"),
       (18, 0, 0, 3, "交换机组网"),

       (19, 0, 0, 4, "光缆续接"),
       (20, 0, 0, 4, "光缆续接"),
       (21, 0, 0, 4, "视频搭建"),
       (22, 0, 0, 4, "视频搭建"),
       (23, 0, 0, 4, "交换机组网"),
       (24, 0, 0, 4, "交换机组网"),

       (25, 0, 0, 5, "光缆续接"),
       (26, 0, 0, 5, "光缆续接"),
       (27, 0, 0, 5, "视频搭建"),
       (28, 0, 0, 5, "视频搭建"),
       (29, 0, 0, 5, "交换机组网"),
       (30, 0, 0, 5, "交换机组网"),

       (31, 0, 0, 6, "光缆续接"),
       (32, 0, 0, 6, "光缆续接"),
       (33, 0, 0, 6, "视频搭建"),
       (34, 0, 0, 6, "视频搭建"),
       (35, 0, 0, 6, "交换机组网"),
       (36, 0, 0, 6, "交换机组网");

# 2. 初始化赛组信息

INSERT INTO seat_group(group_name)
VALUES ("A组"),
       ("B组"),
       ("C组"),
       ("D组"),
       ("E组"),
       ("F组");


# 3. 初始化 config 表（只存放一条记录）

INSERT INTO config(game_number, game_round) value (0,0);

